export const UPLOAD_FILE_1 = [
  {
    name: 'หนังสือนำส่ง+แบบคำขอรับรองปริญญาฯ',
    key: 1,
  },
  {
    name: 'มคอ.2 ตั้งแต่หน้าปกถึงหน้าสุดท้าย ฉบับที่มีการปรับล่าสุด',
    key: 2,
  },
  { name: 'แบบรายงานข้อมูลเพื่อการรับรองปริญญาตรีทางการศึกษา', key: 3 },
  {
    name: 'รายงานการประชุมในการเห็นชอบหรืออนุมัติหลักสูตรจากสภาสถาบัน',
    key: 4,
  },
  { name: 'เอกสารการผ่าน สป.อว. (กรณีผ่านแล้ว)', key: 5 },
  {
    name: 'อื่นๆ (ถ้ามี) (pdf. ไม่เกิน 2 MB 1 ไฟล์) (ตามไฟล์ข้อ 3 หัวข้อ 2.1 หน่วยงานที่รับผิดชอบหลักสูตรผลิตครู)',
    key: 6,
  },
  { name: 'เอกสาร/หลักฐานอ้างอิงอื่นๆ ถ้ามี (1)', key: 7 },
  {
    name: 'ข้อมูล/เอกสารหลักฐานที่สถาบันจัดส่งเพิ่มเติมตามมติคณะอนุกรรมการ (รอบที่ 1)',
    key: 8,
  },
];

export const UPLOAD_FILE_2 = [
  {
    name: 'หนังสือนำส่ง+แบบคำขอรับรองปริญญาฯ',
    key: 1,
  },
  {
    name: 'มคอ.2 ตั้งแต่หน้าปกถึงหน้าสุดท้าย ฉบับที่มีการปรับล่าสุด',
    key: 2,
  },
  {
    name: 'แบบประเมินมาตรฐานหลักสูตร มาตรฐานการผลิตและมาตรฐานบัณฑิต โดยมีรายละเอียดข้อมูลตามมาตรฐานและเกณฑ์การรับรอง พร้อมเอกสารประกอบ',
    key: 3,
  },
  {
    name: 'ตารางวิเคราะห์เนื้อหาสาระ/สมรรถนะ ในรายวิชาที่เทียบกับมาตรฐานความรู้และประสบการณ์วิชาชีพ',
    key: 4,
  },
  {
    name: 'คำสั่งแต่งตั้งคณะกรรมการพัฒนาหลักสูตร',
    key: 5,
  },
  {
    name: 'เอกสารรายงานการวิพากษ์หลักสูตร และการนำไปใช้ปรับปรุงแก้ไขหลักสูตร',
    key: 6,
  },
  {
    name: 'สำเนาสัญญาจ้างหรือทะเบียนประวัติหรือหลักฐานการขอปฏิบัติการสอน',
    key: 7,
  },
  {
    name: 'เอกสาร/หลักฐานอ้างอิงอื่นๆ ถ้ามี (1)',
    key: 8,
  },
  {
    name: 'ข้อมูล/เอกสารหลักฐานที่สถาบันจัดส่งเพิ่มเติมตามมติคณะอนุกรรมการ (รอบที่ 1)',
    key: 9,
  },
];

export const UPLOAD_FILE_3 = [
  {
    name: 'หนังสือนำส่ง+แบบคำขอรับรองปริญญาฯ',
    key: 1,
  },
  {
    name: 'มคอ.2 ตั้งแต่หน้าปกถึงหน้าสุดท้าย ฉบับที่มีการปรับล่าสุด',
    key: 2,
  },
  {
    name: 'แบบประเมินมาตรฐานหลักสูตร มาตรฐานการผลิตและมาตรฐานบัณฑิต โดยมีรายละเอียดข้อมูลตามมาตรฐานและเกณฑ์การรับรอง พร้อมเอกสารประกอบ',
    key: 3,
  },
  {
    name: 'ตารางวิเคราะห์เนื้อหาสาระ/สมรรถนะ ในรายวิชาที่เทียบกับมาตรฐานความรู้และประสบการณ์วิชาชีพ',
    key: 4,
  },
  {
    name: 'คำสั่งแต่งตั้งคณะกรรมการพัฒนาหลักสูตร',
    key: 5,
  },
  {
    name: 'เอกสารรายงานการวิพากษ์หลักสูตร และการนำไปใช้ปรับปรุงแก้ไขหลักสูตร',
    key: 6,
  },
  {
    name: 'รายงานการประชุมในการเห็นชอบหรืออนุมัติหลักสูตรจากสภาสถาบัน',
    key: 7,
  },
  {
    name: 'เอกสาร/หลักฐานอ้างอิงอื่นๆ ถ้ามี (1)',
    key: 8,
  },
];

export const UPLOAD_FILE_4 = [
  {
    name: 'หนังสือนำส่ง+แบบคำขอรับรองปริญญาฯ',
    key: 1,
  },
  {
    name: 'มคอ.2 ตั้งแต่หน้าปกถึงหน้าสุดท้าย ฉบับที่มีการปรับล่าสุด',
    key: 2,
  },
  {
    name: 'แบบประเมินมาตรฐานหลักสูตร มาตรฐานการผลิตและมาตรฐานบัณฑิต โดยมีรายละเอียดข้อมูลตามมาตรฐานและเกณฑ์การรับรอง พร้อมเอกสารประกอบ',
    key: 3,
  },
  {
    name: 'ตารางวิเคราะห์เนื้อหาสาระ/สมรรถนะ ในรายวิชาที่เทียบกับมาตรฐานความรู้และประสบการณ์วิชาชีพ',
    key: 4,
  },
  {
    name: 'คำสั่งแต่งตั้งคณะกรรมการพัฒนาหลักสูตร',
    key: 5,
  },
  {
    name: 'เอกสารรายงานการวิพากษ์หลักสูตร และการนำไปใช้ปรับปรุงแก้ไขหลักสูตร',
    key: 6,
  },
  {
    name: 'รายงานการประชุมในการเห็นชอบหรืออนุมัติหลักสูตรจากสภาสถาบัน',
    key: 7,
  },
  {
    name: 'เอกสาร/หลักฐานอ้างอิงอื่นๆ ถ้ามี (1)',
    key: 8,
  },
];
export const UPLOAD_FILE_5 = [
  {
    name: 'หนังสือนำส่ง+แบบคำขอรับรองปริญญาฯ',
    key: 1,
  },
  {
    name: 'มคอ.2 ตั้งแต่หน้าปกถึงหน้าสุดท้าย ฉบับที่มีการปรับล่าสุด',
    key: 2,
  },
  {
    name: 'แบบประเมินมาตรฐานหลักสูตร มาตรฐานการผลิตและมาตรฐานบัณฑิต โดยมีรายละเอียดข้อมูลตามมาตรฐานและเกณฑ์การรับรอง พร้อมเอกสารประกอบ',
    key: 3,
  },
  {
    name: 'ตารางวิเคราะห์เนื้อหาสาระ/สมรรถนะ ในรายวิชาที่เทียบกับมาตรฐานความรู้และประสบการณ์วิชาชีพ',
    key: 4,
  },
  {
    name: 'คำสั่งแต่งตั้งคณะกรรมการพัฒนาหลักสูตร',
    key: 5,
  },
  {
    name: 'เอกสารรายงานการวิพากษ์หลักสูตร และการนำไปใช้ปรับปรุงแก้ไขหลักสูตร',
    key: 6,
  },
  {
    name: 'รายงานการประชุมในการเห็นชอบหรืออนุมัติหลักสูตรจากสภาสถาบัน',
    key: 7,
  },
  {
    name: 'เอกสาร/หลักฐานอ้างอิงอื่นๆ ถ้ามี (1)',
    key: 8,
  },
];
