export const UPLOAD_FILE_1 = [
  {
    name: 'หนังสือนำส่ง+แบบคำขอรับรองปริญญาฯ',
    fileName: '',
  },
  { name: 'มคอ.2 ตั้งแต่หน้าปกถึงหน้าสุดท้าย ฉบับที่มีการปรับล่าสุด' },
  { name: 'แบบรายงานข้อมูลเพื่อการรับรองปริญญาตรีทางการศึกษา' },
  { name: 'รายงานการประชุมในการเห็นชอบหรืออนุมัติหลักสูตรจากสภาสถาบัน' },
  { name: 'เอกสารการผ่าน สป.อว. (กรณีผ่านแล้ว)' },
  {
    name: 'อื่นๆ (ถ้ามี) (pdf. ไม่เกิน 2 MB 1 ไฟล์) (ตามไฟล์ข้อ 3 หัวข้อ 2.1 หน่วยงานที่รับผิดชอบหลักสูตรผลิตครู)',
  },
  { name: 'เอกสาร/หลักฐานอ้างอิงอื่นๆ ถ้ามี (1)' },
  {
    name: 'ข้อมูล/เอกสารหลักฐานที่สถาบันจัดส่งเพิ่มเติมตามมติคณะอนุกรรมการ (รอบที่ 1)',
  },
];

export const UPLOAD_FILE_2 = [
  {
    name: 'หนังสือนำส่ง+แบบคำขอรับรองปริญญาฯ',
  },
  {
    name: 'มคอ.2 ตั้งแต่หน้าปกถึงหน้าสุดท้าย ฉบับที่มีการปรับล่าสุด',
  },
  {
    name: 'แบบประเมินมาตรฐานหลักสูตร มาตรฐานการผลิตและมาตรฐานบัณฑิต โดยมีรายละเอียดข้อมูลตามมาตรฐานและเกณฑ์การรับรอง พร้อมเอกสารประกอบ',
  },
  {
    name: 'ตารางวิเคราะห์เนื้อหาสาระ/สมรรถนะ ในรายวิชาที่เทียบกับมาตรฐานความรู้และประสบการณ์วิชาชีพ',
  },
  {
    name: 'คำสั่งแต่งตั้งคณะกรรมการพัฒนาหลักสูตร',
  },
  {
    name: 'เอกสารรายงานการวิพากษ์หลักสูตร และการนำไปใช้ปรับปรุงแก้ไขหลักสูตร',
  },
  {
    name: 'สำเนาสัญญาจ้างหรือทะเบียนประวัติหรือหลักฐานการขอปฏิบัติการสอน',
  },
  {
    name: 'เอกสาร/หลักฐานอ้างอิงอื่นๆ ถ้ามี (1)',
  },
  {
    name: 'ข้อมูล/เอกสารหลักฐานที่สถาบันจัดส่งเพิ่มเติมตามมติคณะอนุกรรมการ (รอบที่ 1)',
  },
];


export const UPLOAD_FILE_3 = [
  {
    name: 'หนังสือนำส่ง+แบบคำขอรับรองปริญญาฯ',
  },
  {
    name: 'มคอ.2 ตั้งแต่หน้าปกถึงหน้าสุดท้าย ฉบับที่มีการปรับล่าสุด',
  },
  {
    name: 'แบบประเมินมาตรฐานหลักสูตร มาตรฐานการผลิตและมาตรฐานบัณฑิต โดยมีรายละเอียดข้อมูลตามมาตรฐานและเกณฑ์การรับรอง พร้อมเอกสารประกอบ',
  },
  {
    name: 'ตารางวิเคราะห์เนื้อหาสาระ/สมรรถนะ ในรายวิชาที่เทียบกับมาตรฐานความรู้และประสบการณ์วิชาชีพ',
  },
  {
    name: 'คำสั่งแต่งตั้งคณะกรรมการพัฒนาหลักสูตร',
  },
  {
    name: 'เอกสารรายงานการวิพากษ์หลักสูตร และการนำไปใช้ปรับปรุงแก้ไขหลักสูตร',
  },
  {
    name: 'รายงานการประชุมในการเห็นชอบหรืออนุมัติหลักสูตรจากสภาสถาบัน',
  },
  {
    name: 'เอกสาร/หลักฐานอ้างอิงอื่นๆ ถ้ามี (1)',
  },
];

export const UPLOAD_FILE_4 = [
  {
    name: 'หนังสือนำส่ง+แบบคำขอรับรองปริญญาฯ',
  },
  {
    name: 'มคอ.2 ตั้งแต่หน้าปกถึงหน้าสุดท้าย ฉบับที่มีการปรับล่าสุด',
  },
  {
    name: 'แบบประเมินมาตรฐานหลักสูตร มาตรฐานการผลิตและมาตรฐานบัณฑิต โดยมีรายละเอียดข้อมูลตามมาตรฐานและเกณฑ์การรับรอง พร้อมเอกสารประกอบ',
  },
  {
    name: 'ตารางวิเคราะห์เนื้อหาสาระ/สมรรถนะ ในรายวิชาที่เทียบกับมาตรฐานความรู้และประสบการณ์วิชาชีพ',
  },
  {
    name: 'คำสั่งแต่งตั้งคณะกรรมการพัฒนาหลักสูตร',
  },
  {
    name: 'เอกสารรายงานการวิพากษ์หลักสูตร และการนำไปใช้ปรับปรุงแก้ไขหลักสูตร',
  },
  {
    name: 'รายงานการประชุมในการเห็นชอบหรืออนุมัติหลักสูตรจากสภาสถาบัน',
  },
  {
    name: 'เอกสาร/หลักฐานอ้างอิงอื่นๆ ถ้ามี (1)',
  },
];
export const UPLOAD_FILE_5 = [
  {
    name: 'หนังสือนำส่ง+แบบคำขอรับรองปริญญาฯ',
  },
  {
    name: 'มคอ.2 ตั้งแต่หน้าปกถึงหน้าสุดท้าย ฉบับที่มีการปรับล่าสุด',
  },
  {
    name: 'แบบประเมินมาตรฐานหลักสูตร มาตรฐานการผลิตและมาตรฐานบัณฑิต โดยมีรายละเอียดข้อมูลตามมาตรฐานและเกณฑ์การรับรอง พร้อมเอกสารประกอบ',
  },
  {
    name: 'ตารางวิเคราะห์เนื้อหาสาระ/สมรรถนะ ในรายวิชาที่เทียบกับมาตรฐานความรู้และประสบการณ์วิชาชีพ',
  },
  {
    name: 'คำสั่งแต่งตั้งคณะกรรมการพัฒนาหลักสูตร',
  },
  {
    name: 'เอกสารรายงานการวิพากษ์หลักสูตร และการนำไปใช้ปรับปรุงแก้ไขหลักสูตร',
  },
  {
    name: 'รายงานการประชุมในการเห็นชอบหรืออนุมัติหลักสูตรจากสภาสถาบัน',
  },
  {
    name: 'เอกสาร/หลักฐานอ้างอิงอื่นๆ ถ้ามี (1)',
  },
];