export const RequestEduFiles = [
  {
    name: '1.สำเนาปริญญาบัตรหรือสำเนาหนังสือรับรอง',
    fileId: '',
    fileName: '',
  },
  {
    name: '2.สำเนาใบรายนงานผลการศึกษา',
    fileId: '',
    fileName: '',
  },
  {
    name: '3.สำเนาหลักฐานการเปลี่ยนชื่อฯ (ถ้ามี)',
    fileId: '',
    fileName: '',
  },
  {
    name: '4.สำเนาหนังสือรับรองการเทียบวุฒิฯ (ถ้ามี)',
    fileId: '',
    fileName: '',
  },
  {
    name: '5.สำเนาเอกสารคำแปลวุฒิ (ถ้ามี)',
    fileId: '',
    fileName: '',
  },
];

export const RequestTeachingFiles = [
  {
    name: '1.ตารางสอนรายบุคคล',
    fileId: '',
    fileName: '',
  },
  {
    name: '2.สำเนาสัญญาจ้าง',
    fileId: '',
    fileName: '',
  },
  {
    name: '3.หน้งสือรับรองการจ้างต่อ (ถ้ามี)',
    fileId: '',
    fileName: '',
  },
  {
    name: '4.สำเนาคำสั่งให้ไปปฏิบัติหน้าที่สอนฯ (ถ้ามี)',
    fileId: '',
    fileName: '',
  },
];

export const RequestReasonFiles = [
  {
    name: '1.หนังสือบันทึกชี้แจงเหตุผลความจำเป็น (ถ้ามี)',
    fileId: '',
    fileName: '',
  },
  {
    name: '2.หลักฐานการพัฒนาตนเอง',
    fileId: '',
    fileName: '',
  },
];

export const RequestAttachFiles = [
  {
    name: 'หนังสือนำส่งจากสถานศึกษา (ฉบับจริงและวันที่ออกหนังสือไม่เกิน 30 วัน)',
    fileId: '',
    fileName: '',
  },
  {
    name: 'สำเนาหนังสือแต่งตั้ง ผอ. หรือ รอง ผอ.รักษาราชการแทนจากต้นสังกัด (กรณีรักษาการผู้อำนวยการ)',
    fileId: '',
    fileName: '',
  },
  {
    name: 'หนังสือรับรองการจ้างต่อ (กรณีที่สัญญาจ้างปัจจุบันที่เหลือระยะเวลาการจ้างน้อยกว่า 30 วัน)',
    fileId: '',
    fileName: '',
  },
  {
    name: 'สำเนาคำสั่งให้ไปปฏิบัติการสอนในสถานศึกษาจากต้นสังกัด หรือสำเนาหนังสือส่งตัวรับตัวจากต้นสังกัดถึงสถานศึกษา (กรณี จ้างโดย สพป./สพม./ต้นสังกัด)',
    fileId: '',
    fileName: '',
  },
  {
    name: 'หนังสือบันทึกชี้แจงเหตุผลความจำเป็นของสถานศึกษาและปัญหาการพัฒนาตนเองไม่ทันตามกำหนดระยะเวลา(กรณีได้รับอนุญาตฯ ครบตามกำหนดระยะเวลา)',
    fileId: '',
    fileName: '',
  },
  { name: 'รูปถ่าย 1 นิ้ว', fileId: '', fileName: '' },
];
