import { FileGroup } from '@ksp/shared/interface';

export const RequestEduFiles: FileGroup[] = [
  {
    name: '1.สำเนาปริญญาบัตรหรือสำเนาหนังสือรับรอง',
    files: [],
  },
  {
    name: '2.สำเนาใบรายนงานผลการศึกษา',
    files: [],
  },
  {
    name: '3.สำเนาหลักฐานการเปลี่ยนชื่อฯ (ถ้ามี)',
    files: [],
  },
  {
    name: '4.สำเนาหนังสือรับรองการเทียบวุฒิฯ (ถ้ามี)',
    files: [],
  },
  {
    name: '5.สำเนาเอกสารคำแปลวุฒิ (ถ้ามี)',
    files: [],
  },
];

export const RequestTeachingFiles: FileGroup[] = [
  {
    name: '1.ตารางสอนรายบุคคล',
    files: [],
  },
  {
    name: '2.สำเนาสัญญาจ้าง',
    files: [],
  },
  {
    name: '3.หน้งสือรับรองการจ้างต่อ (ถ้ามี)',
    files: [],
  },
  {
    name: '4.สำเนาคำสั่งให้ไปปฏิบัติหน้าที่สอนฯ (ถ้ามี)',
    files: [],
  },
];

export const RequestReasonFiles: FileGroup[] = [
  {
    name: '1.หนังสือบันทึกชี้แจงเหตุผลความจำเป็น (ถ้ามี)',
    files: [],
  },
  {
    name: '2.หลักฐานการพัฒนาตนเอง',
    files: [],
  },
];

export const RequestAttachFiles: FileGroup[] = [
  {
    name: 'หนังสือนำส่งจากสถานศึกษา (ฉบับจริงและวันที่ออกหนังสือไม่เกิน 30 วัน)',
    files: [],
  },
  {
    name: 'สำเนาหนังสือแต่งตั้ง ผอ. หรือ รอง ผอ.รักษาราชการแทนจากต้นสังกัด (กรณีรักษาการผู้อำนวยการ)',
    files: [],
  },
  {
    name: 'หนังสือรับรองการจ้างต่อ (กรณีที่สัญญาจ้างปัจจุบันที่เหลือระยะเวลาการจ้างน้อยกว่า 30 วัน)',
    files: [],
  },
  {
    name: 'สำเนาคำสั่งให้ไปปฏิบัติการสอนในสถานศึกษาจากต้นสังกัด หรือสำเนาหนังสือส่งตัวรับตัวจากต้นสังกัดถึงสถานศึกษา (กรณี จ้างโดย สพป./สพม./ต้นสังกัด)',
    files: [],
  },
  {
    name: 'หนังสือบันทึกชี้แจงเหตุผลความจำเป็นของสถานศึกษาและปัญหาการพัฒนาตนเองไม่ทันตามกำหนดระยะเวลา(กรณีได้รับอนุญาตฯ ครบตามกำหนดระยะเวลา)',
    files: [],
  },
  { name: 'รูปถ่าย 1 นิ้ว', files: [] },
];
