export const levels = [
  { label: 'ประกาศนียบัตรวิชาชีพ (ปวช.)', value: 'level6' },
  { label: 'ชั้นมัธยมปีที่ 1-3', value: 'level4' },
  { label: 'ชั้นประถมปีที่ 1-3', value: 'level2' },
  { label: 'อนุบาล', value: 'level1' },
  {
    label: 'ประกาศนียบัตรวิชาชีพขั้นสูง (ปวส.) / อนุปริญญา',
    value: 'level7',
  },
  { label: 'ชั้นมัธยมปีที่ 4-6', value: 'level5' },
  { label: 'ชั้นประถมปีที่ 4-6', value: 'level3' },
];

export const subjects = [
  { label: 'ภาษาไทย', value: 's1' },
  { label: 'วิทยาศาสตร์', value: 's2' },
  { label: 'คณิตศาสตร์', value: 's3' },
  { label: 'ภาษาต่างประเทศ', value: 's4' },
  { label: 'ปฐมวัย', value: 's5' },
  {
    label: 'เทคโนโลยีสารสนเทศและการสื่อสาร',
    value: 's6',
  },
  { label: 'สุขศึกษาและพละศึกษา', value: 's7' },
  { label: 'คหกรรม', value: 's8' },
  { label: 'พาณิชยกรรม/บริหารธุรกิจ', value: 's9' },
  {
    label: 'สังคมศึกษา ศาสนาและวัฒนธรรม',
    value: 's10',
  },
  { label: 'ศิลปกรรม', value: 's11' },
  { label: 'อุตสาหกรรม', value: 's12' },
  { label: 'การงานอาชีพและเทคโนโลยี', value: 's13' },
  { label: 'เกษตรกรรม', value: 's14' },
  { label: 'อุตสาหกรรมสิ่งทอ', value: 's15' },
  { label: 'อื่นๆ', value: 's18' },
  { label: 'ประมง', value: 's16' },
  { label: 'อุตสาหกรรมท่องเที่ยว', value: 's17' },
];

// ใช้ อ้างอิง tab ในหน้าใบคำขอเพื่อระบุรายการไฟล์ ที่เกี่ยวข้อง
export enum RequestPageType {
  educationTab = 'educationTab',
  teachingTab = 'teachingTab',
  reasonTab = 'reasonTab',
  fileAttachTab = 'fileAttachTab',
}

export enum SchoolRequestType {
  'ขอยื่นผู้ประสานงาน',
  'ขอยื่นถอดถอนผู้ประสานงาน',
  'ขอหนังสืออนุญาตประกอบวิชาชีพ โดยไม่มีใบอนุญาตประกอบวิชาชีพ (ชาวไทย)',
  'ขอหนังสืออนุญาตประกอบวิชาชีพ โดยไม่มีใบอนุญาตประกอบวิชาชีพ (ผู้บริหาร)',
  'ขอหนังสืออนุญาตประกอบวิชาชีพ โดยไม่มีใบอนุญาตประกอบวิชาชีพ (ชาวต่างชาติ)',
  'ขอสร้างเลขประจำตัวคุรุสภาสำหรับชาวต่างชาติ',
  'ขอเปลี่ยนแปลง/แก้ไขใบอนุญาตประกอบวิชาชีพ ไม่มีใบอนุญาต',
  'ขอหนังสือรับรองคุณวุฒิ',
}

// สถานะใบคำขอ

export enum SchoolRequestProcess {
  'กำลังสร้าง',
  'ยื่นใบคำขอ',
  'กำลังดำเนินการ',
  'ปรับแก้ไข/เพิ่มเติม',
  'ผ่านการตรวจสอบ',
  'ผ่านการรับรอง/พิจารณา',
  'ไม่ผ่านการรับรอง/พิจารณา',
  'ส่งคืนและยกเลิก',
  'หมดอายุ',
  'ยกเลิก',
}

/* export enum SchoolRequestProcess {
  'กำลังสร้าง' = 'creating',
  'ยื่นใบคำขอ' = ' created',
  'กำลังดำเนินการ' = 'proceeding',
  'ปรับแก้ไข/เพิ่มเติม' = 'edit',
  'ผ่านการตรวจสอบ' = 'verified',
  'ผ่านการรับรอง/พิจารณา' = 'certified',
  'ไม่ผ่านการรับรอง/พิจารณา' = 'uncertified',
  'ส่งคืนและยกเลิก' = 'reject',
  'หมดอายุ' = 'expired',
  'ยกเลิก' = 'cancel',
} */

/* export enum SchoolRequestProcess {
  creating = 'กำลังสร้าง',
  created = 'ยื่นใบคำขอ',
  proceeding = 'กำลังดำเนินการ',
  edit = 'ปรับแก้ไข/เพิ่มเติม',
  verified = 'ผ่านการตรวจสอบ',
  certified = 'ผ่านการรับรอง/พิจารณา',
  uncertified = 'ไม่ผ่านการรับรอง/พิจารณา',
  reject = 'ส่งคืนและยกเลิก',
  expired = 'หมดอายุ',
  cancel = 'ยกเลิก',
}
 */
