export enum SelfServiceRequestSubType {
  'ครู' = 1,
  'ผู้บริหารสถานศึกษา' = 2,
  'ผู้บริหารการศึกษา' = 3,
  'ศึกษานิเทศก์' = 4,
  'อื่นๆ' = 5,
}

export enum SelfServiceRequestType {
  'ขอขึ้นทะเบียนใบอนุญาตประกอบวิชาชีพ' = '01',
  'ขอต่ออายุใบอนุญาตประกอบวิชาชีพ' = '02',
  'ขอเปลี่ยนแปลง/แก้ไขใบอนุญาตประกอบวิชาชีพ' = '03',
  'ขอใบแทนใบอนุญาตประกอบวิชาชีพ' = '04',
  'ขอหนังสือรับรองความรู้' = '05',
  'ขอยื่นเทียบเคียงความรู้' = '06',
  'ขอคืนเงินค่าธรรมเนียม' = '30',
  'ขอรับรางวัลคุรุสภา' = '40',
  'ขอรับรางวัลครูภาษาไทยดีเด่น' = '41',
  'ขอรับรางวัลครูผู้สอนดีเด่นตามกลุ่มสาระการเรียนรู้' = '42',
  'ขอรับรางวัลคุรุสดุดี' = '43',
  'ขอรับรางวัลครูอาวุโส' = '44',
  'ขอรับรางวัลผลงานวิจัยของคุรุสภา' = '45',
}
